//=============================================================================
//
// 3Dオブジェクト
// Author : 有田明玄
//
//=============================================================================

//インクルード
#include "Floor.h"
#include "renderer.h"
#include "Application.h"
#include "Shadow.h"

LPDIRECT3DTEXTURE9 CFloor::m_pTexture;		//ポリゴンのテクスチャ
//=============================================================================
// コンストラクタ
//=============================================================================
CFloor::CFloor(int nPriority) :CObject3D(nPriority)
{

}

//=============================================================================
// デストラクタ
//=============================================================================
CFloor::~CFloor()
{

}

//=============================================================================
// 初期化
//=============================================================================
HRESULT  CFloor::Init()
{
	CObject3D::Init();
	SetRot(D3DXVECTOR3(0.0f,D3DX_PI*0.5f,0.0f));	//90°回転
	return S_OK;
}

//=============================================================================
//終了
//=============================================================================
void  CFloor::Uninit()
{
	CObject3D::Uninit();
}

//=============================================================================
// 更新
//=============================================================================
void  CFloor::Update()
{
	CObject3D::Update();
}

//=============================================================================
// 描画
//=============================================================================
void  CFloor::Draw()
{
	LPDIRECT3DDEVICE9 pDevice;
	pDevice = CApplication::GetRenderer()->GetDevice();

	//テクスチャの設定
	pDevice->SetTexture(0, m_pTexture);
	CObject3D::Draw();
	pDevice->SetTexture(0, NULL);
}

//=============================================================================
// 生成
//=============================================================================
CFloor * CFloor::Create(D3DXVECTOR3 pos, D3DXVECTOR3 siz, D3DXVECTOR3 rot)
{
	CFloor*pFloor;
	pFloor = new CFloor(0);
	pFloor->Init();
	pFloor->SetPos(pos);
	pFloor->SetSiz(siz);
	pFloor->SetRot(rot);

	return pFloor;
}

//=============================================================================
// 画像読み込み
//=============================================================================
void CFloor::Load()
{
	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice;
	pDevice = CApplication::GetRenderer()->GetDevice();

	//テクスチャの読み込み処理
	D3DXCreateTextureFromFile(pDevice,
		"data\\TEXTURE\\Floor.png",
		&m_pTexture);
}

//=============================================================================
// 画像破棄
//=============================================================================
void CFloor::Unload()
{
	if (m_pTexture!=nullptr)
	{
		m_pTexture = nullptr;
	}
}
